package com.atguigu.java2;

/*
 * 面向对象
 * 
 * 一.面向对象的三条主线
 *   1.java类及类的成员 （属性，方法，构造器，代码块，内部类）
 *   2.三大特性（封装，继承，多态）-四种（抽象）
 *   3.关键字：super this interface .......
 *   
 * 二.面向过程 vs 面向对象
 * 	 1.人开门
 *   面向过程：人把门开开
 *   面向对象：
 *   人{
 *   	开（门）{
 *        门.开开
 *   	}
 *   }
 *   
 *   门{
 *   	开开（）{
 *   
 *   	}
 *   }
 *   2.人把大象装冰箱
 *   面向过程：人先打开冰箱门，然后搬起大箱，快速地塞进冰箱，然后关上冰箱门。
 *   面向对象：
 *   人{
 *   	打开（冰箱）{
 *   		冰箱.开开
 *   	}
 *   	搬（大象）{
 *   		大象.进入（）;
 *   	}
 *   	关闭（冰箱）{
 *   		冰箱.关门();
 *   	}
 *   }
 *   
 *   大象{
 *   	进入（）{
 *   	}
 *   }
 *   
 *   冰箱{
 *   	开开（）{
 *   	}
 *   	关闭（）{
 *      }
 *   }
 *  
 *  三.java的两个基本要素：类和对象
 *     类：抽象的概念上的定义
 *     对象：实实在在的个体
 *     对象是由类派生出来的（new 出来的）
 *  
 *  四.类的成员
 *    属性 = 成员变量 = field = 域
 *    方法 = method = 成员函数 = 成员方法
 * 
 */
public class OOP {

}
